<template>
  <el-amap 
    style="height: 400px;"
    :zoom="zoom"
    :center="center"
  >
    <el-amap-massmarks
      :data="data"
      :styles="styles"
    ></el-amap-massmarks>
  </el-amap>
</template>

<script>
export default {
  data () {
    return {
      zoom: 6,
      center: [116.3, 39.1],
      data: [
        {"lnglat":[116.258446,37.686622],"name":"景县","style":2},{"lnglat":[113.559954,22.124049],"name":"圣方济各堂区","style":2},{"lnglat":[116.366794,39.915309],"name":"西城区","style":2},{"lnglat":[116.486409,39.921489],"name":"朝阳区","style":2},{"lnglat":[116.286968,39.863642],"name":"丰台区","style":2},{"lnglat":[116.195445,39.914601],"name":"石景山区","style":2},{"lnglat":[116.310316,39.956074],"name":"海淀区","style":2},{"lnglat":[116.105381,39.937183],"name":"门头沟区","style":2},{"lnglat":[116.139157,39.735535],"name":"房山区","style":2},{"lnglat":[116.658603,39.902486],"name":"通州区","style":2},{"lnglat":[116.653525,40.128936],"name":"顺义区","style":2},{"lnglat":[116.235906,40.218085],"name":"昌平区","style":2},{"lnglat":[116.338033,39.728908],"name":"大兴区","style":2},{"lnglat":[116.637122,40.324272],"name":"怀柔区","style":2},{"lnglat":[117.112335,40.144783],"name":"平谷区","style":2},{"lnglat":[116.843352,40.377362],"name":"密云区","style":2},{"lnglat":[115.985006,40.465325],"name":"延庆区","style":2},{"lnglat":[113.56925,22.136546],"name":"路凼填海区","style":2},{"lnglat":[117.195907,39.118327],"name":"和平区","style":2},{"lnglat":[117.226568,39.122125],"name":"河东区","style":2},{"lnglat":[117.217536,39.101897],"name":"河西区","style":2},{"lnglat":[117.164143,39.120474],"name":"南开区","style":2},{"lnglat":[117.201569,39.156632],"name":"河北区","style":2},{"lnglat":[117.163301,39.175066],"name":"红桥区","style":2},{"lnglat":[117.313967,39.087764],"name":"东丽区","style":2},{"lnglat":[117.012247,39.139446],"name":"西青区","style":2},{"lnglat":[117.382549,38.989577],"name":"津南区","style":2},{"lnglat":[117.13482,39.225555],"name":"北辰区","style":2},{"lnglat":[117.057959,39.376925],"name":"武清区","style":2},{"lnglat":[117.308094,39.716965],"name":"宝坻区","style":2},{"lnglat":[117.654173,39.032846],"name":"滨海新区","style":2},{"lnglat":[117.82828,39.328886],"name":"宁河区","style":2},{"lnglat":[116.925304,38.935671],"name":"静海区","style":2},{"lnglat":[117.407449,40.045342],"name":"蓟州区","style":2},{"lnglat":[113.558783,22.154124],"name":"嘉模堂区","style":2},{"lnglat":[114.548151,38.047501],"name":"长安区","style":2},{"lnglat":[114.462931,38.028383],"name":"桥西区","style":2},{"lnglat":[114.465974,38.067142],"name":"新华区","style":2},{"lnglat":[114.058178,38.069748],"name":"井陉矿区","style":2},{"lnglat":[114.533257,38.027696],"name":"裕华区","style":2},{"lnglat":[114.849647,38.033767],"name":"藁城区","style":2},{"lnglat":[114.321023,38.093994],"name":"鹿泉区","style":2},{"lnglat":[114.654281,37.886911],"name":"栾城区","style":2},{"lnglat":[114.144488,38.033614],"name":"井陉县","style":2},{"lnglat":[114.569887,38.147835],"name":"正定县","style":2},{"lnglat":[114.552734,38.437422],"name":"行唐县","style":2},{"lnglat":[114.37946,38.306546],"name":"灵寿县","style":2},{"lnglat":[114.610699,37.605714],"name":"高邑县","style":2},{"lnglat":[115.200207,38.18454],"name":"深泽县","style":2},{"lnglat":[114.387756,37.660199],"name":"赞皇县","style":2},{"lnglat":[114.977845,38.176376],"name":"无极县","style":2},{"lnglat":[114.184144,38.259311],"name":"平山县","style":2},{"lnglat":[114.52618,37.762514],"name":"元氏县","style":2},{"lnglat":[114.775362,37.754341],"name":"赵县","style":2},{"lnglat":[115.217451,37.92904],"name":"辛集市","style":2},{"lnglat":[115.044886,38.027478],"name":"晋州市","style":2},{"lnglat":[114.68578,38.344768],"name":"新乐市","style":2},{"lnglat":[113.54167,22.187778],"name":"风顺堂区","style":2},{"lnglat":[118.210821,39.615162],"name":"路南区","style":2},{"lnglat":[118.174736,39.628538],"name":"路北区","style":2},{"lnglat":[118.45429,39.715736],"name":"古冶区","style":2},{"lnglat":[118.264425,39.676171],"name":"开平区","style":2},{"lnglat":[118.110793,39.56303],"name":"丰南区","style":2},{"lnglat":[118.155779,39.831363],"name":"丰润区","style":2},{"lnglat":[118.446585,39.278277],"name":"曹妃甸区","style":2},{"lnglat":[118.699547,39.744851],"name":"滦县","style":2},{"lnglat":[118.681552,39.506201],"name":"滦南县","style":2},{"lnglat":[118.905341,39.42813],"name":"乐亭县","style":2},{"lnglat":[118.305139,40.146238],"name":"迁西县","style":2},{"lnglat":[117.753665,39.887323],"name":"玉田县","style":2},{"lnglat":[117.965875,40.188616],"name":"遵化市","style":2},{"lnglat":[118.701933,40.012108],"name":"迁安市","style":2},{"lnglat":[113.55374,22.188119],"name":"大堂区","style":2},{"lnglat":[119.596224,39.943458],"name":"海港区","style":2},{"lnglat":[119.753591,39.998023],"name":"山海关区","style":2},{"lnglat":[119.486286,39.825121],"name":"北戴河区","style":2},{"lnglat":[118.954555,40.406023],"name":"青龙满族自治县","style":2},{"lnglat":[119.164541,39.709729],"name":"昌黎县","style":2},{"lnglat":[119.240651,39.887053],"name":"抚宁区","style":2},{"lnglat":[118.881809,39.891639],"name":"卢龙县","style":2},{"lnglat":[113.550252,22.193791],"name":"望德堂区","style":2},{"lnglat":[114.484989,36.603196],"name":"邯山区","style":2},{"lnglat":[114.494703,36.611082],"name":"丛台区","style":2},{"lnglat":[114.458242,36.615484],"name":"复兴区","style":2},{"lnglat":[114.209936,36.420487],"name":"峰峰矿区","style":2},{"lnglat":[114.610703,36.337604],"name":"临漳县","style":2},{"lnglat":[114.680356,36.443832],"name":"成安县","style":2},{"lnglat":[115.152586,36.283316],"name":"大名县","style":2},{"lnglat":[113.673297,36.563143],"name":"涉县","style":2},{"lnglat":[114.38208,36.367673],"name":"磁县","style":2},{"lnglat":[114.805154,36.555778],"name":"肥乡区","style":2},{"lnglat":[114.496162,36.776413],"name":"永年区","style":2},{"lnglat":[115.168584,36.81325],"name":"邱县","style":2},{"lnglat":[114.878517,36.914908],"name":"鸡泽县","style":2},{"lnglat":[114.950859,36.483603],"name":"广平县","style":2},{"lnglat":[115.289057,36.539461],"name":"馆陶县","style":2},{"lnglat":[114.93411,36.354248],"name":"魏县","style":2},{"lnglat":[114.957588,36.773398],"name":"曲周县","style":2},{"lnglat":[114.194581,36.696115],"name":"武安市","style":2},{"lnglat":[113.549052,22.199175],"name":"花王堂区","style":2},{"lnglat":[114.507131,37.064125],"name":"桥东区","style":2},{"lnglat":[114.473687,37.068009],"name":"桥西区","style":2},{"lnglat":[114.561132,37.05073],"name":"邢台县","style":2},{"lnglat":[114.506873,37.444009],"name":"临城县","style":2},{"lnglat":[114.511523,37.287663],"name":"内丘县","style":2},{"lnglat":[114.693382,37.483596],"name":"柏乡县","style":2},{"lnglat":[114.776348,37.350925],"name":"隆尧县","style":2},{"lnglat":[114.684469,37.129952],"name":"任县","style":2},{"lnglat":[114.691377,37.003812],"name":"南和县","style":2},{"lnglat":[114.921027,37.618956],"name":"宁晋县","style":2},{"lnglat":[115.038782,37.21768],"name":"巨鹿县","style":2},{"lnglat":[115.247537,37.526216],"name":"新河县","style":2},{"lnglat":[115.142797,37.075548],"name":"广宗县","style":2},{"lnglat":[115.029218,37.069404],"name":"平乡县","style":2},{"lnglat":[115.272749,36.983272],"name":"威县","style":2},{"lnglat":[115.668999,37.059991],"name":"清河县","style":2},{"lnglat":[115.498684,36.8642],"name":"临西县","style":2},{"lnglat":[115.398102,37.359668],"name":"南宫市","style":2},{"lnglat":[114.504902,36.861903],"name":"沙河市","style":2}
      ],
      styles: [
        {
          url: 'https://a.amap.com/jsapi_demos/static/images/mass2.png',
          anchor: [3, 3],
          size: [5, 5]
        },
        {
          url: 'https://a.amap.com/jsapi_demos/static/images/mass0.png',
          anchor: [3, 3],
          size: [5, 5]
        },
        {
          url: 'https://a.amap.com/jsapi_demos/static/images/mass1.png',
          anchor: [3, 3],
          size: [5, 5]
        }
      ]
    }
  },
  methods: {
    
  }
}
</script>